---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Visual.AssetPropertyTime
source: html/5ec3c2b1-cb6f-e202-3801-7cc8d96c5586.htm
---
# AssetPropertyTime Members

Adds a new connected asset attached to this asset property, if it allows it.